# Джейден Смит, сын Уила Смита, является звездой таких фильмов, как "Каратэ-пацан" (2010) и "После Земли" (2013).
# Джейден так же известен своей философией, которую он распространяет через Twitter.
# Когда он пишет в твиттере, он почти всегда пишет каждое слово с большой буквы.
# Для простоты вам придётся писать каждое слово с заглавной буквы.
# Посмотрите, какими должны быть сокращения в приведенном ниже примере.
# Ваша задача состоит в том, чтобы преобразовать строки в то, как они были бы написны Джеденом Смитом.
# Строки являются настоящими цитатами Джейдена Смита, но они не написаны с заглавной буквы так, как он их
# изначально напечатал.

# Пример:
# Not Jaden-Cased: "How can mirrors be real if our eyes aren't real"
# Jaden-Cased: "How Can Mirrors Be Real If Our Eyes Aren't Real"

string_1 = "How can mirrors be real if our eyes aren't real"
print(string_1.title())