# 3.	Создать пустую переменную. Проверить ее на истинность и ложность. Объясните полученный результат.
a = ()
print(bool(a))
# Все пустые переменные имеют значание False, так как не занимают никакую длину