# 9.	Дан список [student1, student2, student3]
# с помощью цикла for добавить к каждому элементу списка слово “_good”. Вывести на экран.
spis = ['student1', 'student2', 'student3']
spis2 = []
for i in spis:
    spis2.append(i + '_good')
print(spis2)