# 7.	Создать список с числами от 1 до 50 используя генератор списков.
spis = [i for i in range(1,51)]
print(spis)